<?php
interface TimeToWordConvertingInterface{
    public function convert();
};
class TimeToWordConverting implements TimeToWordConvertingInterface{
    public function convert()
    {
        $hour = $_POST['hour'];
        $minute = $_POST['minute'];
        $minuteR = array(
            0 => "ноль",
            1 => "одна минута после",
            2 => "две минуты после",
            3 => "три минуты после",
            4 => "четыре минуты после",
            5 => "пять минуты после",
            6 => "шесть минут после",
            7 => "семь минут после",
            8 => "восемь минут после",
            9 => "девять минут после",
            10 => "десять минут после",
            11 => "одиннадцать минут после",
            12 => "двеннадцать минут после",
            13 => "триннадцать минут после",
            14 => "четырнадцать минут после",
            15 => "",
            16 => "шестьнадцать минут после",
            17 => "семьнадцать минут после",
            18 => "восемьнадцать минут после",
            19 => "девятнадцать минут после",
            20 => "двадцать минут после",
            21 => "двадцать одина минута после",
            22 => "двадцать две минуты после",
            23 => "двадцать три минуты после",
            24 => "двадцать четыре минуты после",
            25 => "двадцать пять минут после",
            26 => "двадцать шесть минут после",
            27 => "двадцать семь минут после",
            28 => "двадцать восемь минут после",
            29 => "двадцать девять минут после",
            30 => "половина",
            31 => "двадцать девять минут до",
            32 => "двадцать восемь минут до",
            33 => "двадцать семь минут до",
            34 => "двадцать шесть минут до",
            35 => "двадцать пять минут до",
            36 => "двадцать четыре минуты до",
            37 => "двадцать три минуты до",
            38 => "двадцать две минуты до",
            39 => "двадцать одна минута до",
            40 => "двадцать минут до",
            41 => "девятнадцать минут до",
            42 => "восемьнадцать минут до",
            43 => "семьнадцать минут до",
            44 => "шестьнадцать минут до",
            45 => "пятнцадцать минут до",
            46 => "четырнадцать минут до",
            47 => "триннадцать минут до",
            48 => "двеннадцать минут до",
            49 => "одиннадцать минут до",
            50 => "десят минут до",
            51 => "девять минут до",
            52 => "восемь минут до",
            53 => "семь минут до",
            54 => "шесть минут до",
            55 => "пять минут до",
            56 => "четыре минуты до",
            57 => "три минуты до",
            58 => "две минуты до",
            59 => "одна минута до"
        );
        $houRSS = array(
            1 => "часа",
            2 => "двух",
            3 => "трех",
            4 => "четырех",
            5 => "пяти",
            6 => "шести",
            7 => "семи",
            8 => "восьми",
            9 => "девяти",
            10 => "десяти",
            11 => "одинадцати",
            12 => "двенадцати",
            13 => "тринадцати",
            14 => "четырнадцати",
            15 => "пятнадцати",
            16 => "шестьнадцати",
            17 => "семьнадцати",
            18 => "восемьнадцати",
            19 => "девятнцадцати",
            20 => "двадцати",
            21 => "двадцать одного",
            22 => "двадцать двух",
            23 => "двадцать трех"
        );
        $i = 0;
        $cicle = 0;
        while ($cicle == 1){
            if ($hour == $i) {
                if ($minute >= 30) {
                    $i++;
                    $hour = $houRSS[$i];
                    $minute = $minuteR[$minute];
                    echo $minute, $hour;
                    $cicle = 1;
                } else if ($minute == 15) {
                    $i++;
                    $hour = $houRSS[$i];
                    $minute = "четверть";
                    echo $minute, $hour;
                    $cicle = 1;
                    } else if ($minute < 30) {
                        $hour = $houRSS[$hour];
                        $minute = $minuteR[$minute];
                        echo $hour, $minute;
                        $cicle = 1;
                    }
            } else {
                $i++;
            }
        }
    }
}

$user = new TimeToWordConverting;
$user->convert();